SURV/src/DataProcessors/ЗагрузкаПользователейИзAD/ЗагрузкаПользователейИзAD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПользователейИзAD</name>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользователиAD</name>
    <attributes>
      <name>Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заблокирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Логин</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Домен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SURV/src/DataProcessors/ЗагрузкаПользователейИзAD/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыделитьВсе(Команда)
	УстановитьВсеФлагиЗагрузки(Истина);
	Элементы.ПользователиAD.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьВсеФлагиЗагрузки(Ложь);
	Элементы.ПользователиAD.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеФлагиЗагрузки(Флаг)
	Для Каждого СтрокаТЧ Из Объект.ПользователиAD Цикл 
		СтрокаТЧ.Загружать = Флаг;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Если Не ЗначениеЗаполнено(Объект.Офис) Тогда 
		ПоказатьПредупреждение(Неопределено, "Не выбран Офис!");
		Возврат;
	КонецЕсли;
	ЗагрузкаПользователей();	
	Элементы.ПользователиAD.Обновить();
	ПоказатьПредупреждение(Неопределено, "Готово!",2);
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаПользователей()
	Объект.ПользователиAD.Очистить();
	ТаблицаДанных = Сервер.ПолучитьТаблицуПользователейИзAD(Объект.Офис);
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл 
		НовСтрокаТЧ = Объект.ПользователиAD.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТЧ,СтрокаДанных);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователей(Команда)
	СозданиеПользователей();
	ПоказатьПредупреждение(Неопределено, "Готово",2);
КонецПроцедуры

&НаСервере
Процедура СозданиеПользователей()
	Сервер.ЗагрузитьПользователейОфиса(Объект.Офис,Объект.ПользователиAD,Истина);	//потом доделать выбор Офиса!
КонецПроцедуры
